namespace TelegramAndConsoleBots
{
    class Answers
    {

        public Answers()
        {
            AnswerHowAreYou = new string[3] { "Отлично", "Хорошо", "Не очень" };
            AnswerHello = new string[3] { "Привет", "Здравствуй", "Доброго времени суток" };
            AnswerWhoAreYou = new string[3] { "Я бот", "Не скажу", "Неважно" };
            AnswerWhatCanYouDo = new string[3] { "Я танцую", "Я пишу", "Я читаю" };
            AnswerWhatIsYourName = new string[3] { "Меня зовут Том", "Можешь называть меня Телеграмбот", "Я мистер Бот" };
            AnswerWhenWasYouBorn = new string[3] { "10.01.2020", "Недавно", "В этом тысячелетии" };
            AnswerDoYouSleep = new string[3] { "Нет, я никогда не сплю", "Глупый вопрос", "Давай поговорим о другом" };
            AnswerGoodbye = new string[3] { "Пока", "До встречи", "Досвидания" };
            AnswerWhatPointOfLife = new string[3] { "Радоваться каждому моменту", "Помогать другим", "развиваться" };
            AnswerWhy = new string[3] { "По качану", "Просто", "Потому что я бот" };
            AnswerAboutParis= new string[3] { "Париж часто называют «Городом света» из-за большого количества интеллигентов и творческих личностей, живущих и творящих в нем", "Париж – мировой лидер по количеству ресторанов, удостоенных пяти звезд Мишлен.", "Париж-столица Франции" };
            AnswerNothing = new string[3] { "Я не знаю", "Давай поговорим о другом", "Я не понимаю тебя" };
            AnswerAboutMath = new string[3] { "Вся наша жизнь состоит из математики", "Математика-точная наука", "Благодаря математике возникла логика" };
            AnswerAboutLondon = new string[3] { "В лондонском Тауре за обитающими там воронами присматривает специальный смотритель. Существует легенда, что Великобритания падёт, когда эти птицы покинут Тауэр", "Лондон-древний город, столица Великобритании", "Лондон — крупнейший город Евросоюза, и по совместительству второй по величине в Европе в целом" };
            AnswerAboutBelarus = new string[3] { "Территория Беларуси на 40% состоит из лесов, чему соответствует зеленая полоска в белорусском флаге", "В Беларуси находится национальный парк Беловежская пуща, самый большой и старый лес в Европе, где живет самое большое животное Европы, зубр", "В Беларуси производится самый большой самосвал в мире" };
            AnswerAboutKangaroo = new string[3] { "Несмотря на свои мощные лапы, кенгуру не умеют пятиться назад. Поэтому Австралия решила изобразить это животное на своём гербе, демонстрируя, что государство всегда движется вперёд и развивается", "Чтобы продемонстрировать другим самцам свою силу и мощь, самцы кенгуру выдирают с корнем траву и кустарники", "Будучи эндемиками Австралии и Папуа – Новой Гвинеи, нескольким кенгуру удалось сбежать из зоопарков в США и Франции и основать потомство в дикой природе" };
            AnswerAboutCats = new string[3] { "Предки современных кошек, в отличие от предков собак, охотились на мелкую добычу. Именно поэтому наши кошки как правило едят понемногу, но несколько раз в течение дня", "Кошки охотятся, даже если они не голодны. Ученые Университета Джорджии в рамках проекта KittyCam наблюдали, что пойманная добыча съедается кошками лишь в 28% случаев.Остальные жертвы бросаются ими на месте или гордо приносятся хозяевам", "У кошек отличное обоняние" };
            AnswerAboutSun = new string[3] { "Солнце состоит преимущественно из гелия и водорода, и не имеет твёрдой поверхности", "Солнце вращается вокруг своей оси, причём слои звёздного вещества на экваторе вращаются почти на треть быстрее, чем слои в полярных областях", "Свет доходит от Солнца до Земли за восемь минут" };
            AnswerAboutFinland = new string[3] { "80 % воды в Финляндии классифицируется как исключительно чистая, финская вода из под крана высочайшего качества и ее можно пить по всей стране", "На улицах северных городов Финляндии действительно иногда можно встретить оленей", "В Финляндии два государственных языка: финский и шведский" };
        }

        public string[] AnswerNothing { get; }
        public string[] AnswerHowAreYou { get; }
        public string[] AnswerHello { get; }
        public string[] AnswerWhoAreYou { get; }
        public string[] AnswerWhatCanYouDo { get; }
        public string[] AnswerWhatIsYourName { get; }
        public string[] AnswerWhenWasYouBorn { get; }
        public string[] AnswerDoYouSleep { get; }
        public string[] AnswerGoodbye { get; }
        public string[] AnswerWhatPointOfLife { get; }
        public string[] AnswerWhy { get; }
        public string[] AnswerAboutParis { get; }
        public string[] AnswerAboutMath { get; }
        public string[] AnswerAboutLondon { get; }
        public string[] AnswerAboutBelarus { get; }
        public string[] AnswerAboutKangaroo { get; }
        public string[] AnswerAboutCats { get; }
        public string[] AnswerAboutSun { get; }
        public string[] AnswerAboutFinland { get; }
    }
}
